Language learning/learn-english-from-fresh-words.html
<div id="outline-container-org3a874f3" class="outline-3">
<h3 id="org3a874f3"><span class="section-number-3">1.1.</span> Specific terms:</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Check out a <b>Balance Sheet</b> to see a financial summary of a company's assets, liabilities and equity.</li>
<li>Create and manage your own tables using <b>Google Sheets</b>.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb725907" class="outline-2">
<h2 id="orgb725907"><span class="section-number-2">2.</span> minute</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Time (Pronounced <i>MIN<sub>it</sub></i>)
<ul class="org-ul">
<li><b>60 seconds</b></li>
<li><b>Short moment</b>: A very brief period of time.</li>
</ul></li>
<li>Size (Pronounced <i>my-NEWT</i>)
<ul class="org-ul">
<li><b>Extremely small</b>: Tiny or microscopic in size.</li>
<li><b>Insignificant</b>: Very little importance.</li>
<li><b>Detailed</b>: Marked by close attension to tiny details (e.g. "minute examination").</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org51ef93c" class="outline-2">
<h2 id="org51ef93c"><span class="section-number-2">3.</span> conversation</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>An interactive, verbal or written exchange of ideas, thoughts, feelings and information between 2 or more people.</b> It requires active participation - both speaking and listening.
</p>
</div>
<div id="outline-container-org024d53f" class="outline-3">
<h3 id="org024d53f"><span class="section-number-3">3.1.</span> Key Elements of a Conversation</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><b>Turn-taking</b>: Participants alternate between listening and speaking.</li>
<li><b>Information Exchange</b>: The goal is usually to convey news, solve problems or simply share experience.</li>
<li><b>Medium</b>: Face-to-face, over the phone or digitally through text and messaging apps.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc4c32fb" class="outline-3">
<h3 id="orgc4c32fb"><span class="section-number-3">3.2.</span> Types of Conversations</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Conversations can range from casual to highly structured:
</p>

<ul class="org-ul">
<li><b>Small Talk</b>: Light, casual conversation used to break the ice or discuss impersonal topics like the wheather.</li>
<li><b>Discussion</b>: A more serious exchange of ideas to explore an issue or to make a decision.</li>
<li><b>Heart-to-Heart</b>: An intimate, personal exchange where individuals share deep feelings and trust.</li>
<li><b>Debate</b>: A highly structured, formal argument where different viewpoints systematically defined.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc504588" class="outline-3">
<h3 id="orgc504588"><span class="section-number-3">3.3.</span> Etymology</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The word originates from the Latin <i>conversatio</i>, which combines <i>con-</i> ("together") and <i>versare</i> ("to turn"). Historically, it literally meant "turning together" and originally referred to general social behavior or how individuals lived their lives together.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfea4acf" class="outline-2">
<h2 id="orgfea4acf"><span class="section-number-2">4.</span> verbatim</h2>
<div class="outline-text-2" id="text-4">
<p>
<i>və(ː)ˈbeɪtɪm</i>
</p>

<p>
<b>Word-for-word, using exactly the same words as were originally spoken or written.</b> It ensures the information is reproduced precisely with no alterations.
</p>
</div>
<div id="outline-container-orga2cf78c" class="outline-3">
<h3 id="orga2cf78c"><span class="section-number-3">4.1.</span> Usage Examples:</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><b>Adverb</b>: "The reporter wrote down the president's speech <b>verbatim</b>."</li>
<li><b>Adjective</b>: "The lawyer provided a <b>verbatim</b> transcript of the court hearing."</li>
</ul>
</div>
</div>
<div id="outline-container-orgca78dbc" class="outline-3">
<h3 id="orgca78dbc"><span class="section-number-3">4.2.</span> Etymology</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The term drives from Medieval Latin <i>verbātim</i>, which combines the Latin word <i>verbum</i> (meaning "word") with an adverbail suffix meaning "by the" or "in".
</p>
</div>
</div>
<div id="outline-container-org1eb4807" class="outline-3">
<h3 id="org1eb4807"><span class="section-number-3">4.3.</span> Common Synonyms</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Word for word</li>
<li>Exactly</li>
<li>Precisely</li>
<li>Directly</li>
</ul>
</div>
</div>
<div id="outline-container-orgf201278" class="outline-3">
<h3 id="orgf201278"><span class="section-number-3">4.4.</span> Common question</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Q1: Is "literally" a synonyms of verbatim?
A1: No. They have different meanings and distinct uses.
</p>
<ul class="org-ul">
<li>The Difference
<ul class="org-ul">
<li><b>Verbatim</b>: Means coping or repeating words <b>exactly as spoken or written</b> (word-for-word).</li>
<li><b>Literally</b>: Means something happened <b>exactly in a strict sense</b>, without exaggeration or metaphor.</li>
</ul></li>
<li>Examples Contrast
<ul class="org-ul">
<li>"Copy this <b>verbatim</b>." (Use the exact same words).</li>
<li>"I am <b>literally</b> freezing." (Your body temperature is actually dropping; you are not using a figure of speech).</li>
</ul></li>
<li>Cross-Over Exception
They only overlap in very specific contexts regarding translation or interpretation:
<ul class="org-ul">
<li>A "<b>leteral</b> translation" can mean a "<b>verbatim</b> translation" (translating word-for-word instead of for overall meaning).</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org68e8869" class="outline-2">
<h2 id="org68e8869"><span class="section-number-2">5.</span> correspond</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>To communicate with someone in writing (such as via email or letters) or to match and be similiar to something else.</b>
</p>

<ol class="org-ol">
<li>To Match or Be Equivalent
This describes situations where two things share a similar nature, quantity or structure.
<ul class="org-ul">
<li><b>Example usage</b>: "The numbers on the answer key <b>correspond</b> to the question on the test."</li>
<li><b>Example usage</b>: "Her version of the event didn't <b>correspond</b> with the witness's statement."</li>
</ul></li>
<li>To Communicate in Writing
This refers to the act of exchanging message or letters, usually over a long period of distance.
<ul class="org-ul">
<li><b>Example usage</b>: "They <b>correspond</b> regularly through email."</li>
<li><b>Example usage</b>: "He <b>correspond</b> with several experts in the field."</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org2ee92d7" class="outline-2">
<h2 id="org2ee92d7"><span class="section-number-2">6.</span> introverted</h2>
<div class="outline-text-2" id="text-6">
<p>
Describes <b>a personality trait characterized by a focus on internal thoughts, feelings and mood rather than seeking external <a href="#org6120cc5">stimulation</a></b>. Introverts typically recharge their energy through solitude and quiet environments, often finding large social gathering draining.
</p>
</div>
<div id="outline-container-org91c3288" class="outline-3">
<h3 id="org91c3288"><span class="section-number-3">6.1.</span> The Science of Energy</h3>
<div class="outline-text-3" id="text-6-1">
<p>
In psychology - a framework popularized by Carl Jung - the distinction between introverts and extroverts comes down to how you process and regain energy.
</p>

<ul class="org-ul">
<li><b>Introverts</b> gain energy from their internal world. After engaging in heavy social interaction, they usually need to retreat to a quiet environment to mentally recharge.</li>
<li><b>Extroverts</b> gain energey from outside world and are stimulated by social interactions.</li>
</ul>
</div>
</div>
<div id="outline-container-org692769a" class="outline-3">
<h3 id="org692769a"><span class="section-number-3">6.2.</span> Common Traits</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Introverts often share several behavioral and mental characteristics:
</p>

<ul class="org-ul">
<li>Deep Focus: They prefer concentrating on a few projects or ideas in-depth rather than multitasking across many.</li>
<li>Quality Relationships: They generally favor close, intimate friendships over large social networks.</li>
<li>Observation: They tend to think things through internally before speaking or taking actions.</li>
</ul>
</div>
</div>
<div id="outline-container-org5f77871" class="outline-3">
<h3 id="org5f77871"><span class="section-number-3">6.3.</span> Common Misconceptions</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>Myth: Introversion is the same as shyness or anti-social behavior. Shyness <a href="#org26451e7">involves</a> a fear of social judgement, whereas introversion simply <a href="#org309deb7">dictates</a> how much social stimulation one can handle before needing a break.</li>
<li>Myth: Introverts cannot be leaders or public speakers. Many introverts are highly <a href="#org130ded4">charismatic</a>, confident and effective leaders, though they may still prefer one-to-one meeting over crowdwd networking events.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6120cc5" class="outline-2">
<h2 id="org6120cc5"><span class="section-number-2">7.</span> stimulation</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>Stimulation</b> refers to <b>the act of arousing, encouraging, or exciting an individual, organism, or system to increased activity, energy, or development</b>.
</p>

<p>
It can refer to anything that <span class="underline">provokes</span> a physical, mental, or emotional response.
</p>
</div>
