Language learning/learn-english-from-fresh-words.html
<div id="outline-container-org9c608e4" class="outline-3">
<h3 id="org9c608e4"><span class="section-number-3">11.3.</span> Usage Examples</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li><b>Academic:</b> "The students were required to submit a 1,000-word <b>essay</b> on the French Revolution."</li>
<li><b>Literary:</b> "She published a brilliant <b>essay</b> exploring the themes of <span class="underline">mortality</span> in modern poetry."</li>
<li><b>Verb (Formal/ <span class="underline">Archaic</span>):</b> "He decided to <b>essay</b> a challenging climb up the north face of the mountain."</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7a6f00c" class="outline-2">
<h2 id="org7a6f00c"><span class="section-number-2">12.</span> impact</h2>
<div class="outline-text-2" id="text-12">
<p>
<b>Impact</b> primarily refers to <b>a forceful collision between objects or a powerful, lasting effect on a person or situation</b>. As a noun, it means a strike or physical shock; as a verb, it means to hit with force or to significantly influence something.
</p>
</div>
<div id="outline-container-org6e8861a" class="outline-3">
<h3 id="org6e8861a"><span class="section-number-3">12.1.</span> Core Meanings by Context</h3>
<div class="outline-text-3" id="text-12-1">
</div>
<div id="outline-container-orga2789a5" class="outline-4">
<h4 id="orga2789a5"><span class="section-number-4">12.1.1.</span> Physical Impact (Collision)</h4>
<div class="outline-text-4" id="text-12-1-1">
<p>
In mechanical, engineering, or everyday contexts, impact is the forceful contact or collision between two or more objects. It represents the sudden transfer of energy and force.
</p>

<ul class="org-ul">
<li>The force of the <b>impact</b> deployed the car airbags.</li>
<li>The glass shattered on <b>impact</b>.</li>
<li>A crater formed where the meteor <b>impacted</b> the ground.</li>
</ul>
</div>
</div>
<div id="outline-container-org132a235" class="outline-4">
<h4 id="org132a235"><span class="section-number-4">12.1.2.</span> Influence or Effect (Figurative)</h4>
<div class="outline-text-4" id="text-12-1-2">
<p>
In business, social, or academic contexts, impact denotes the profound influence or strong consequence that an idea, action, or event has on a system, community, or individual.
</p>

<ul class="org-ul">
<li>Assessing the environmental <b>impact</b> of global warming.</li>
<li>The company's new policy <b>impacted</b> employee retention.</li>
<li>Measuring the social <b>impact</b> of a community project.</li>
</ul>
</div>
</div>
<div id="outline-container-orgab715e7" class="outline-4">
<h4 id="orgab715e7"><span class="section-number-4">12.1.3.</span> Medical and Dental</h4>
<div class="outline-text-4" id="text-12-1-3">
<p>
In health, the word can also describe the lodging or wedging of one body part firmly against another, such as an <b>impacted wisdom tooth</b>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org424917e" class="outline-2">
<h2 id="org424917e"><span class="section-number-2">13.</span> engage</h2>
<div class="outline-text-2" id="text-13">
<p>
<b>To participate in, connect with, or commit to something.</b> It is a versatile verb used <b>to describe capturing attention, hiring someone's services, starting a conflict, or locking mechanical parts together.</b> 
</p>
</div>
<div id="outline-container-org7f160b2" class="outline-3">
<h3 id="org7f160b2"><span class="section-number-3">13.1.</span> Usage Contexts</h3>
<div class="outline-text-3" id="text-13-1">
<p>
The exact meaning depends on how the word is used in a sentence:
</p>
</div>
<div id="outline-container-orgbf6d31d" class="outline-4">
<h4 id="orgbf6d31d"><span class="section-number-4">13.1.1.</span> To participate or involve oneself</h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
To take part in an activity, often followed by "in" or "with" (e.g., <i>"to engage in a debate"</i> or <i>"to engage with an audience"</i>).
</p>
</div>
</div>
<div id="outline-container-org85a9653" class="outline-4">
<h4 id="org85a9653"><span class="section-number-4">13.1.2.</span> To attract and hold interest</h4>
<div class="outline-text-4" id="text-13-1-2">
<p>
To captivate or occupy someone's attention (e.g., <i>"The teacher engaged the students with a story"</i>).
</p>
</div>
</div>
<div id="outline-container-org86cd260" class="outline-4">
<h4 id="org86cd260"><span class="section-number-4">13.1.3.</span> To hire or secure services</h4>
<div class="outline-text-4" id="text-13-1-3">
<p>
To employ someone (e.g., <i>"to engage a lawyer"</i>). 
</p>
</div>
</div>
<div id="outline-container-org76f77e2" class="outline-4">
<h4 id="org76f77e2"><span class="section-number-4">13.1.4.</span> To interlock or mesh</h4>
<div class="outline-text-4" id="text-13-1-4">
<p>
To lock mechanical gears or parts together.
</p>
</div>
</div>
<div id="outline-container-org953c788" class="outline-4">
<h4 id="org953c788"><span class="section-number-4">13.1.5.</span> To enter into conflict</h4>
<div class="outline-text-4" id="text-13-1-5">
<p>
In military or formal contexts, to attack or begin fighting (e.g., <i>"to engage the enemy"</i>).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org448e782" class="outline-2">
<h2 id="org448e782"><span class="section-number-2">14.</span> patent</h2>
<div class="outline-text-2" id="text-14">
<p>
A "<b>patent</b>" is <b>an intellectual property right granted by a government to an inventor</b>. It gives the owner the exclusive legal right to exclude others from making, using, selling, or importing the invention for a limited period, typically 20 years, in exchange for publicly disclosing how the invention works.
</p>
</div>
<div id="outline-container-org25f78be" class="outline-3">
<h3 id="org25f78be"><span class="section-number-3">14.1.</span> Key Concepts</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-orgcf093b0" class="outline-4">
<h4 id="orgcf093b0"><span class="section-number-4">14.1.1.</span> The Quid Pro Quo</h4>
<div class="outline-text-4" id="text-14-1-1">
<p>
A patent is essentially a bargain between the inventor and the public.
</p>
<ul class="org-ul">
<li><b>The Inventor's Benefit:</b> Receives a temporary monopoly to profit from their work.</li>
<li><b>The Public's Benefit:</b> Detailed blueprints and instructions are published.</li>
<li><b>The Goal:</b> Ensures that once the patent expires, the technology enters the public domain, allowing others to freely use and improve upon it.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb519954" class="outline-4">
<h4 id="orgb519954"><span class="section-number-4">14.1.2.</span> Types of Patents</h4>
<div class="outline-text-4" id="text-14-1-2">
<p>
Patents are generally categorized into three main types:
</p>
<ol class="org-ol">
<li><b>Utility Patents:</b> Protect how a product functions, works, or is manufactured (e.g., new machinery, chemical formulas, or software).</li>
<li><b>Design Patents:</b> Protect the aesthetic or ornamental appearance of a functional item (e.g., the shape of a smartphone or a unique shoe design).</li>
<li><b>Plant Patents:</b> Safeguard new, asexually reproduced plant varieties.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgbd60e72" class="outline-3">
<h3 id="orgbd60e72"><span class="section-number-3">14.2.</span> Requirements for Patentability</h3>
<div class="outline-text-3" id="text-14-2">
<p>
Not all ideas can be patented. To qualify for a utility patent, an invention must meet three strict criteria:
</p>

<ul class="org-ul">
<li><b>Novel:</b> It must be entirely new and not previously known or published anywhere in the world.</li>
<li><b>Useful:</b> It must have a practical application and actually perform its intended purpose.</li>
<li><b>Non-obvious:</b> It must involve a creative step that would not be obvious to someone with ordinary skill in that particular field of technology.</li>
</ul>
</div>
</div>
<div id="outline-container-org959d134" class="outline-3">
<h3 id="org959d134"><span class="section-number-3">14.3.</span> Related Terminology</h3>
<div class="outline-text-3" id="text-14-3">
<ul class="org-ul">
<li><b>Patent Pending:</b> A phrase used by inventors or companies while a patent application is actively under review. It serves as a warning to competitors that a patent may soon be granted.</li>
<li><b>Infringement:</b> The unauthorized making, using, or selling of a patented invention during the life of the patent. Patent holders can take legal action to stop this and seek damages.</li>
<li><b>Patent Troll (Non-Practicing Entity):</b> A colloquial term for a person or company that buys the rights to a patent with the sole intent of suing others for infringement, rather than actually manufacturing or developing the product themselves.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf1d677e" class="outline-2">
<h2 id="orgf1d677e"><span class="section-number-2">15.</span> campaign</h2>
<div class="outline-text-2" id="text-15">
<p>
A <b>campaign</b> is <b>a planned, coordinated series of actions designed to achieve a specific goal</b>. It typically involves a set of activities intended to promote a cause, influence public opinion, sell a product, or achieve a military objective.
</p>
</div>
<div id="outline-container-orgaccff48" class="outline-3">
<h3 id="orgaccff48"><span class="section-number-3">15.1.</span> Key Contexts and Fields</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-org5883898" class="outline-4">
<h4 id="org5883898"><span class="section-number-4">15.1.1.</span> Politics</h4>
<div class="outline-text-4" id="text-15-1-1">
<p>
A series of organized activities, such as rallies, debates, and advertisements, by a candidate or party to win an election.
</p>
</div>
</div>
<div id="outline-container-orgc3e41df" class="outline-4">
<h4 id="orgc3e41df"><span class="section-number-4">15.1.2.</span> Business &amp; Marketing</h4>
<div class="outline-text-4" id="text-15-1-2">
<p>
A coordinated advertising effort to promote a specific product, service, or brand over a set period of time.
</p>
</div>
</div>
<div id="outline-container-org9675c7c" class="outline-4">
<h4 id="org9675c7c"><span class="section-number-4">15.1.3.</span> Social &amp; Environmental</h4>
<div class="outline-text-4" id="text-15-1-3">
<p>
An organized effort—such as petitions, protests, or awareness drives—to bring about social change or influence government policy.
</p>
</div>
</div>
