Language learning/learn-english-from-fresh-words.html
<div id="outline-container-orgdc64da5" class="outline-4">
<h4 id="orgdc64da5"><span class="section-number-4">20.1.4.</span> Forestry</h4>
<div class="outline-text-4" id="text-20-1-4">
<p>
The science of planting, managing, and caring for forests and timber.
</p>
</div>
</div>
</div>
<div id="outline-container-org8f29589" class="outline-3">
<h3 id="org8f29589"><span class="section-number-3">20.2.</span> The Modern Agricultural Sector</h3>
<div class="outline-text-3" id="text-20-2">
<p>
Beyond the physical act of farming, agriculture encompasses the entire economic and social sector that supports it, including:
</p>
<ul class="org-ul">
<li>Agricultural research</li>
<li>Food processing</li>
<li>Global supply chains that distribute produce to consumers</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5edbd8f" class="outline-2">
<h2 id="org5edbd8f"><span class="section-number-2">21.</span> yield</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-orgb820f96" class="outline-3">
<h3 id="orgb820f96"><span class="section-number-3">21.1.</span> <i>verb</i> (PRODUCE)</h3>
<div class="outline-text-3" id="text-21-1">
<p>
<b>to supply or produce something positive such as a profit, an amount of food or information</b>:
</p>
<ul class="org-ul">
<li>an attempt to yield increased profits</li>
<li>The investigation yielded some unexpected results.</li>
<li>Favourable weather yielded a good crop.</li>
</ul>
</div>
</div>
<div id="outline-container-org59e8455" class="outline-3">
<h3 id="org59e8455"><span class="section-number-3">21.2.</span> <i>noun</i> (PRODUCE/PROCEEDS)</h3>
<div class="outline-text-3" id="text-21-2">
<p>
<b>an amount of something positive, such as food or profit, that is produced or supplied</b>:
</p>
<ul class="org-ul">
<li>Crop yields have risen steadily.</li>
<li>Yields on gas and electricity shares are consistently high.</li>
</ul>
</div>
</div>
<div id="outline-container-org4fdb4bd" class="outline-3">
<h3 id="org4fdb4bd"><span class="section-number-3">21.3.</span> <i>verb</i> (GIVE UP)</h3>
<div class="outline-text-3" id="text-21-3">
<p>
<b>to give up the control of or responsibility for something, often because you have been forced to</b>:
</p>
<ul class="org-ul">
<li>They were forced to yield (up) their land to the occupying forces.</li>
<li>Despite renewed pressure to give up the occupied territory, they will not yield.</li>
</ul>
</div>
</div>
<div id="outline-container-org67b1c9d" class="outline-3">
<h3 id="org67b1c9d"><span class="section-number-3">21.4.</span> <i>verb</i> (BEND/BREAK)</h3>
<div class="outline-text-3" id="text-21-4">
<p>
<b>to bend or break under pressure</b>:
</p>
<ul class="org-ul">
<li>His legs began to yield under the sheer weight of his body.</li>
</ul>
</div>
</div>
<div id="outline-container-org0eca118" class="outline-3">
<h3 id="org0eca118"><span class="section-number-3">21.5.</span> <i>verb</i> (STOP)</h3>
<div class="outline-text-3" id="text-21-5">
<p>
<b>to stop in order to allow other vehicles to go past, especially before you drive onto a bigger road</b>:
</p>
<ul class="org-ul">
<li>yield to something</li>
</ul>
</div>
</div>
<div id="outline-container-org34b8db9" class="outline-3">
<h3 id="org34b8db9"><span class="section-number-3">21.6.</span> References</h3>
<div class="outline-text-3" id="text-21-6">
<ul class="org-ul">
<li><a href="https://dictionary.cambridge.org/dictionary/english/yield">https://dictionary.cambridge.org/dictionary/english/yield</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb6c6ac2" class="outline-2">
<h2 id="orgb6c6ac2"><span class="section-number-2">22.</span> eliminate</h2>
<div class="outline-text-2" id="text-22">
<p>
To "<b>eliminate</b>" means <b>to completely remove, get rid of, or exclude something</b>. It is an action verb used in several specific contexts:
</p>

<ul class="org-ul">
<li><b>Removal</b>: To take something out or put an end to it (e.g., <i>eliminate errors in a report</i> or <i>eliminate fatty foods from a diet</i>).</li>
<li><b>Competition</b>: To defeat an opponent so they are knocked out of a tournament.</li>
<li><b>Consideration</b>: To dismiss someone or something as a possible suspect or option.</li>
<li><b>Biology</b>: To expel waste matter from a living body.</li>
<li><b>Mathematics</b>: To remove an unknown variable from simultaneous equations.</li>
</ul>
</div>
</div>
<div id="outline-container-orga88adf3" class="outline-2">
<h2 id="orga88adf3"><span class="section-number-2">23.</span> impose</h2>
<div class="outline-text-2" id="text-23">
<p>
To "<b>impose</b>" means <b>to force or enforce something—such as a rule, penalty, or one's own will—upon someone else</b>. It also means to take unfair advantage of or to inconvenience someone, such as <span class="underline">obtruding</span> on their time or hospitality.
</p>
</div>
<div id="outline-container-org937bb70" class="outline-3">
<h3 id="org937bb70"><span class="section-number-3">23.1.</span> Etymology</h3>
<div class="outline-text-3" id="text-23-1">
<p>
The verb comes from the Middle French <b>imposer</b>, which derives from the Latin <b>imponere</b>, literally meaning "to put upon" (from <b>in-</b> meaning "on" + <b>ponere</b> meaning "to put"). 
</p>
</div>
</div>
<div id="outline-container-orga70df2b" class="outline-3">
<h3 id="orga70df2b"><span class="section-number-3">23.2.</span> Core Meanings &amp; Usage Examples</h3>
<div class="outline-text-3" id="text-23-2">
</div>
<div id="outline-container-org451aa69" class="outline-4">
<h4 id="org451aa69"><span class="section-number-4">23.2.1.</span> 1. Enforcing rules, laws, or penalties</h4>
<div class="outline-text-4" id="text-23-2-1">
<p>
To apply or establish something by authority, often forcing someone to accept or comply.
</p>
<ul class="org-ul">
<li><b>Examples:</b> "The government decided to <i>impose</i> a new tax on imported luxury goods." "The referee was forced to <i>impose</i> a strict penalty."</li>
</ul>
</div>
</div>
<div id="outline-container-org49d2a55" class="outline-4">
<h4 id="org49d2a55"><span class="section-number-4">23.2.2.</span> 2. Forcing presence or will</h4>
<div class="outline-text-4" id="text-23-2-2">
<p>
To inflict one's own beliefs, tastes, or presence on unwilling individuals.
</p>
<ul class="org-ul">
<li><b>Examples:</b> "Parents should be careful not to <i>impose</i> their own career goals on their children."</li>
</ul>
</div>
</div>
<div id="outline-container-org90b0869" class="outline-4">
<h4 id="org90b0869"><span class="section-number-4">23.2.3.</span> 3. Taking advantage of someone (Imposing on)</h4>
<div class="outline-text-4" id="text-23-2-3">
<p>
To intrude upon someone’s time, kindness, or good nature, expecting them to do favors when it is inconvenient. 
</p>
<ul class="org-ul">
<li><b>Examples:</b> "I’d love to crash at your place for the weekend, but I don't want to <i>impose</i>."</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4271c3f" class="outline-3">
<h3 id="org4271c3f"><span class="section-number-3">23.3.</span> Synonyms</h3>
<div class="outline-text-3" id="text-23-3">
<ul class="org-ul">
<li><b>Inflict:</b> To bring about or cause (something unpleasant).</li>
<li><b>Levy:</b> To officially charge and collect a payment (e.g., taxes or fines).</li>
<li><b>Intrude:</b> To enter uninvited or take liberties with someone's time.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga761478" class="outline-2">
<h2 id="orga761478"><span class="section-number-2">24.</span> loan</h2>
<div class="outline-text-2" id="text-24">
<p>
A "<b>loan</b>" is <b>a financial transaction where one party (the lender) advances money or assets to another party (the borrower)</b>. In return, the borrower agrees to pay back the original amount (the principal) over time, usually along with an additional fee called <b>interest</b>.
</p>
</div>
<div id="outline-container-orgf3c0295" class="outline-3">
<h3 id="orgf3c0295"><span class="section-number-3">24.1.</span> Key Components of a Loan</h3>
<div class="outline-text-3" id="text-24-1">
</div>
<div id="outline-container-org4ed6980" class="outline-4">
<h4 id="org4ed6980"><span class="section-number-4">24.1.1.</span> Principal</h4>
<div class="outline-text-4" id="text-24-1-1">
<p>
The original amount of money borrowed.
</p>
</div>
</div>
<div id="outline-container-org2d0bd28" class="outline-4">
<h4 id="org2d0bd28"><span class="section-number-4">24.1.2.</span> Interest</h4>
<div class="outline-text-4" id="text-24-1-2">
<p>
The cost of borrowing the money, usually calculated as a percentage of the principal.
</p>
</div>
</div>
<div id="outline-container-org0aa2d3c" class="outline-4">
<h4 id="org0aa2d3c"><span class="section-number-4">24.1.3.</span> Term/Tenure</h4>
<div class="outline-text-4" id="text-24-1-3">
<p>
The length of time you have to repay the loan in full.
</p>
</div>
</div>
<div id="outline-container-orgd1def0c" class="outline-4">
<h4 id="orgd1def0c"><span class="section-number-4">24.1.4.</span> Collateral</h4>
<div class="outline-text-4" id="text-24-1-4">
<p>
An asset (such as a car or home) that a borrower pledges to guarantee the loan.
</p>
</div>
</div>
</div>
<div id="outline-container-org2f7adf7" class="outline-3">
<h3 id="org2f7adf7"><span class="section-number-3">24.2.</span> Common Types of Loans</h3>
<div class="outline-text-3" id="text-24-2">
</div>
<div id="outline-container-orgbcd6e87" class="outline-4">
<h4 id="orgbcd6e87"><span class="section-number-4">24.2.1.</span> Secured Loans</h4>
<div class="outline-text-4" id="text-24-2-1">
<p>
Backed by collateral. If you fail to repay, the lender can seize the asset. 
</p>
</div>
<ol class="org-ol">
<li><a id="org9a27429"></a>Examples<br />
<div class="outline-text-5" id="text-24-2-1-1">
<ul class="org-ul">
<li>Mortgages (for purchasing property)</li>
<li>Auto loans</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4d5c85d" class="outline-4">
<h4 id="org4d5c85d"><span class="section-number-4">24.2.2.</span> Unsecured Loans</h4>
<div class="outline-text-4" id="text-24-2-2">
<p>
Not backed by an asset. Lenders evaluate your creditworthiness to determine approval and interest rates.
</p>
</div>
<ol class="org-ol">
<li><a id="org28ec66c"></a>Examples<br />
<div class="outline-text-5" id="text-24-2-2-1">
<ul class="org-ul">
<li>Personal loans</li>
<li>Credit cards</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org1e02143" class="outline-4">
<h4 id="org1e02143"><span class="section-number-4">24.2.3.</span> Fixed-Rate Loans</h4>
<div class="outline-text-4" id="text-24-2-3">
<p>
The interest rate remains the same for the entire life of the loan.
</p>
</div>
</div>
<div id="outline-container-org7a9e400" class="outline-4">
<h4 id="org7a9e400"><span class="section-number-4">24.2.4.</span> Variable-Rate Loans</h4>
<div class="outline-text-4" id="text-24-2-4">
<p>
The interest rate can change over time based on market conditions.
</p>
</div>
</div>
</div>
</div>
