Language learning/learn-english-from-fresh-words.html
<div id="outline-container-orgca3a6cd" class="outline-2">
<h2 id="orgca3a6cd"><span class="section-number-2">25.</span> contract</h2>
<div class="outline-text-2" id="text-25">
<p>
A "<b>contract</b>" is <b>a legally binding agreement between two or more parties that outlines specific rights, duties, and obligations</b>. It typically involves an exchange of value (like goods, services, or money) and provides legal remedies if the terms are <span class="underline">breached</span>.
</p>
</div>
<div id="outline-container-orgcbc8a9a" class="outline-3">
<h3 id="orgcbc8a9a"><span class="section-number-3">25.1.</span> Key Elements of a Valid Contract</h3>
<div class="outline-text-3" id="text-25-1">
<p>
To be legally enforceable, an agreement usually requires the following core components:
</p>
</div>
<div id="outline-container-orgbe129ea" class="outline-4">
<h4 id="orgbe129ea"><span class="section-number-4">25.1.1.</span> Offer</h4>
<div class="outline-text-4" id="text-25-1-1">
<p>
A clear proposal to enter into a specific deal.
</p>
</div>
</div>
<div id="outline-container-org23f4488" class="outline-4">
<h4 id="org23f4488"><span class="section-number-4">25.1.2.</span> Acceptance</h4>
<div class="outline-text-4" id="text-25-1-2">
<p>
Unconditional agreement to the exact terms of the offer.
</p>
</div>
</div>
<div id="outline-container-orge88d6ca" class="outline-4">
<h4 id="orge88d6ca"><span class="section-number-4">25.1.3.</span> Consideration</h4>
<div class="outline-text-4" id="text-25-1-3">
<p>
Something of value exchanged between the parties (e.g., money, services, or a promise not to do something).
</p>
</div>
</div>
<div id="outline-container-org9251a1b" class="outline-4">
<h4 id="org9251a1b"><span class="section-number-4">25.1.4.</span> Intent</h4>
<div class="outline-text-4" id="text-25-1-4">
<p>
Both parties must intend for the agreement to be recognized by law.
</p>
</div>
</div>
<div id="outline-container-orgc2ad47b" class="outline-4">
<h4 id="orgc2ad47b"><span class="section-number-4">25.1.5.</span> Capacity</h4>
<div class="outline-text-4" id="text-25-1-5">
<p>
Parties must be of legal age, sober, and mentally competent.
</p>
</div>
</div>
<div id="outline-container-org882c65a" class="outline-4">
<h4 id="org882c65a"><span class="section-number-4">25.1.6.</span> Legality</h4>
<div class="outline-text-4" id="text-25-1-6">
<p>
The contract must be for a lawful purpose.
</p>
</div>
</div>
</div>
<div id="outline-container-org259277a" class="outline-3">
<h3 id="org259277a"><span class="section-number-3">25.2.</span> Types of Contracts</h3>
<div class="outline-text-3" id="text-25-2">
<dl class="org-dl">
<dt>Express Contract</dt><dd>The terms are clearly stated, either verbally or in writing.</dd>
<dt>Implied Contract</dt><dd>The agreement is formed by the actions and conduct of the parties rather than their explicit words (e.g., ordering food at a restaurant implies you will pay for it).</dd>
<dt>Unilateral Contract</dt><dd>One party makes a promise in exchange for a specific action from the other party (e.g., a reward for a lost pet).</dd>
<dt>Bilateral Contract</dt><dd>Both parties exchange promises to perform (e.g., a standard employment agreement).</dd>
</dl>
</div>
</div>
<div id="outline-container-orgc9d86ad" class="outline-3">
<h3 id="orgc9d86ad"><span class="section-number-3">25.3.</span> What Happens if a Contract is Broken?</h3>
<div class="outline-text-3" id="text-25-3">
<p>
If one party fails to fulfill their obligations without a legal excuse, it is known as a <b>breach of contract</b>. The injured party can pursue legal remedies, which may include:
</p>
<ol class="org-ol">
<li><b>Damages</b>: Financial compensation for the losses suffered.</li>
<li><b>Specific Performance</b>: A court order requiring the breaching party to complete the task they originally promised.</li>
<li><b>Rescission</b>: Canceling the contract entirely and returning both parties to their pre-contract state.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge7886f8" class="outline-2">
<h2 id="orge7886f8"><span class="section-number-2">26.</span> extend</h2>
<div class="outline-text-2" id="text-26">
<p>
<b>Extend</b> broadly means <b>to stretch out, prolong in time, or increase in scope, space, or meaning</b>. It applies to physical space (stretching a limb or boundary), time (lengthening a deadline), or reach (expanding a company's offerings). 
</p>
</div>
<div id="outline-container-org193960f" class="outline-3">
<h3 id="org193960f"><span class="section-number-3">26.1.</span> Examples by Category</h3>
<div class="outline-text-3" id="text-26-1">
</div>
<div id="outline-container-org8827c10" class="outline-4">
<h4 id="org8827c10"><span class="section-number-4">26.1.1.</span> 1. Physical Space &amp; Distance</h4>
<div class="outline-text-4" id="text-26-1-1">
<ul class="org-ul">
<li><b>Meaning:</b> To stretch outward, straighten, or reach across a physical area.</li>
<li><b>Usage:</b> "He extended his hand to greet her," or "The hiking trail extends for 10 miles."</li>
</ul>
</div>
</div>
<div id="outline-container-org786925c" class="outline-4">
<h4 id="org786925c"><span class="section-number-4">26.1.2.</span> 2. Time &amp; Duration</h4>
<div class="outline-text-4" id="text-26-1-2">
<ul class="org-ul">
<li><b>Meaning:</b> To prolong or delay a deadline.</li>
<li><b>Usage:</b> "The manager extended the project deadline by two weeks."</li>
</ul>
</div>
</div>
<div id="outline-container-org9f944c9" class="outline-4">
<h4 id="org9f944c9"><span class="section-number-4">26.1.3.</span> 3. Scope &amp; Reach</h4>
<div class="outline-text-4" id="text-26-1-3">
<ul class="org-ul">
<li><b>Meaning:</b> To broaden the application, influence, or range of something.</li>
<li><b>Usage:</b> "The airline extended its flight routes to include new international hubs," or "These policies extend to all employees."</li>
</ul>
</div>
</div>
<div id="outline-container-org857b2b6" class="outline-4">
<h4 id="org857b2b6"><span class="section-number-4">26.1.4.</span> 4. Offerings &amp; Services</h4>
<div class="outline-text-4" id="text-26-1-4">
<ul class="org-ul">
<li><b>Meaning:</b> To grant, <span class="underline">bestow</span>, or make available.</li>
<li><b>Usage:</b> "Please extend a warm welcome to our guest," or "The bank decided to extend a line of credit."</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org6ad803d" class="outline-2">
<h2 id="org6ad803d"><span class="section-number-2">27.</span> trim</h2>
<div class="outline-text-2" id="text-27">
<p>
"<b>Trim</b>" is a versatile word that usually means <b>to make something neat by cutting away excess, or to decorate and adjust</b>. Depending on the context, its specific meaning shifts across different fields.
</p>
</div>
<div id="outline-container-org967f386" class="outline-3">
<h3 id="org967f386"><span class="section-number-3">27.1.</span> Meanings by Context</h3>
<div class="outline-text-3" id="text-27-1">
</div>
<div id="outline-container-org54fe47b" class="outline-4">
<h4 id="org54fe47b"><span class="section-number-4">27.1.1.</span> Daily Life</h4>
<div class="outline-text-4" id="text-27-1-1">
<ul class="org-ul">
<li><b>Verb</b>: To clip or cut small amounts (e.g., getting a hair trim, trimming a hedge, or cutting fat off meat).</li>
<li><b>Adjective</b>: Describes someone who is physically fit or something that is neat and orderly.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd257dfa" class="outline-4">
<h4 id="orgd257dfa"><span class="section-number-4">27.1.2.</span> Home Improvement</h4>
<div class="outline-text-4" id="text-27-1-2">
<p>
Refers to the finishing materials in a room, such as baseboards, crown molding, and door or window casings.
</p>
</div>
</div>
<div id="outline-container-org730bbbf" class="outline-4">
<h4 id="org730bbbf"><span class="section-number-4">27.1.3.</span> Aviation</h4>
<div class="outline-text-4" id="text-27-1-3">
<p>
An adjustment mechanism on an aircraft (like the trim wheel) that balances the controls so the pilot doesn't have to constantly hold the yoke or stick.
</p>
</div>
</div>
<div id="outline-container-org03c3b4a" class="outline-4">
<h4 id="org03c3b4a"><span class="section-number-4">27.1.4.</span> Technology &amp; Computing</h4>
<div class="outline-text-4" id="text-27-1-4">
<ul class="org-ul">
<li><b>Programming</b>: Refers to the <code>String.prototype.trim()</code> method, which removes whitespace from both ends of a string.</li>
<li><b>Hardware</b>: Refers to the SSD (Solid State Drive) TRIM command that cleans up deleted data blocks to maintain drive speed.</li>
</ul>
</div>
</div>
<div id="outline-container-org0a2c9cc" class="outline-4">
<h4 id="org0a2c9cc"><span class="section-number-4">27.1.5.</span> Sailing</h4>
<div class="outline-text-4" id="text-27-1-5">
<p>
To adjust a sail's angle in relation to the wind, or to balance the cargo on a boat so it sits level in the water.
</p>
</div>
</div>
</div>
</div>
