Language learning/learn-english-from-fresh-words.html
<div id="outline-container-org293c9f5" class="outline-2">
<h2 id="org293c9f5"><span class="section-number-2">28.</span> liberal</h2>
<div class="outline-text-2" id="text-28">
</div>
<div id="outline-container-org6be689f" class="outline-3">
<h3 id="org6be689f"><span class="section-number-3">28.1.</span> Adjective</h3>
<div class="outline-text-3" id="text-28-1">
<p>
adjective: <b>liberal</b>; adjective: <b>Liberal</b>
</p>

<ol class="org-ol">
<li><b>willing to respect or accept behavior or opinions different from one's own; open to new ideas</b>.
<ul class="org-ul">
<li>(in a political context) favoring policies that are socially progressive and promote social welfare.
<dl class="org-dl">
<dt>SYNONYMS</dt><dd>progressive, forward-looking, forward-thinking, progressivist</dd>
</dl></li>
<li id="THEOLOGY">regarding many traditional beliefs as dispensable, invalidated by modern thought, or liable to change.</li>
</ul></li>
<li><b>relating to or denoting a political and social philosophy that promotes individual rights, civil liberties, democracy, and free enterprise</b>.
<dl class="org-dl">
<dt>SYNONYMS</dt><dd>tolerant, unprejudiced, unbigoted, broad-minded, open-minded</dd>
</dl></li>
<li><b>relating to a Liberal party or (in the UK) the Liberal Democrat Party</b>.</li>
<li><b>given, used, or occurring in generous amounts</b>.
<dl class="org-dl">
<dt>SYNONYMS</dt><dd>abundant, copious, ample, plentiful, generous, lavish</dd>
<dt>(no term)</dt><dd>(of a person) giving generously.
<ul class="org-ul">
<li>"Sam was too <b>liberal with</b> the wine"</li>
<li id="SYNONYMS">generous, magnanimous, openhanded, unsparing, unstinting</li>
</ul></dd>
</dl></li>
<li><b>(of education) concerned with broadening a person's general knowledge and experience, rather than with technical or professional training</b>.
<dl class="org-dl">
<dt>SYNONYMS</dt><dd>wide-ranging, broad-based, general, humanistic</dd>
</dl></li>
<li><b>(especially of an interpretation of a law) broadly construed or understood; not strictly literal or exact</b>.
<dl class="org-dl">
<dt>SYNONYMS</dt><dd>flexible, broad, loose, rough, nonrestrictive, free</dd>
</dl></li>
</ol>
</div>
</div>
<div id="outline-container-orgda8f9fd" class="outline-3">
<h3 id="orgda8f9fd"><span class="section-number-3">28.2.</span> Noun</h3>
<div class="outline-text-3" id="text-28-2">
<p>
noun: <b>liberal</b>; plural noun: <b>liberals</b>; noun: <b>Liberal</b>; plural noun: <b>Liberals</b>
</p>

<ol class="org-ol">
<li><b>a supporter of policies that are socially progressive and promote social welfare</b>.
<ul class="org-ul">
<li>"she dissented from the decision, joined by the court's liberals"</li>
</ul></li>
<li><b>a supporter of a political and social philosophy that promotes individual rights, civil liberties, democracy, and free enterprise</b>.</li>
<li><b>a supporter or member of a Liberal party or (in the UK) the Liberal Democrat Party</b>.</li>
</ol>
</div>
</div>
<div id="outline-container-org16e7bc1" class="outline-3">
<h3 id="org16e7bc1"><span class="section-number-3">28.3.</span> Etymology</h3>
<div class="outline-text-3" id="text-28-3">
</div>
<div id="outline-container-orgfdf21a2" class="outline-4">
<h4 id="orgfdf21a2"><span class="section-number-4">28.3.1.</span> Derivation Flow</h4>
<div class="outline-text-4" id="text-28-3-1">
<ul class="org-ul">
<li>LATIN: <b>liber</b> (free (man)) -&gt; LATIN: <b>liberalis</b> \
=&gt; OLD FRENCH \
=&gt; ENGLISH: <b>liberal arts</b> -&gt; ENGLISH: <b>liberal</b> (Middle English)</li>
</ul>
</div>
</div>
<div id="outline-container-orge1864b0" class="outline-4">
<h4 id="orge1864b0"><span class="section-number-4">28.3.2.</span> Etymology Note</h4>
<div class="outline-text-4" id="text-28-3-2">
<p>
Middle English: via Old French from Latin <i>liberalis</i>, from <i>liber</i> 'free (man)'. The original sense was 'suitable for a free man', hence 'suitable for a gentleman' (one not tied to a trade), surviving in <i>liberal arts</i>. Another early sense 'generous' (compare with <b>liberal</b> (sense 4 of the adjective)) gave rise to an obsolete meaning 'free from restraint', leading to <b>liberal</b> (sense 1 of the adjective) (late 18th century).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org9bc4a08" class="outline-2">
<h2 id="org9bc4a08"><span class="section-number-2">29.</span> cognitive</h2>
<div class="outline-text-2" id="text-29">
<p>
"<b>Cognitive</b>" relates to <b>the mental processes involved in acquiring knowledge, processing information, and understanding the world</b>. It encompasses conscious and unconscious activities like thinking, memory, learning, perception, attention, and decision-making.
</p>
</div>
<div id="outline-container-org8c001b1" class="outline-3">
<h3 id="org8c001b1"><span class="section-number-3">29.1.</span> Core Fields of Study</h3>
<div class="outline-text-3" id="text-29-1">
</div>
<div id="outline-container-org734024a" class="outline-4">
<h4 id="org734024a"><span class="section-number-4">29.1.1.</span> Cognitive Psychology</h4>
<div class="outline-text-4" id="text-29-1-1">
<p>
This branch of psychology examines internal mental states, focusing on how people perceive, process, and store information. It explores how we interpret our senses, form memories, and solve problems.
</p>
</div>
</div>
<div id="outline-container-org8167bc8" class="outline-4">
<h4 id="org8167bc8"><span class="section-number-4">29.1.2.</span> Cognitive Development</h4>
<div class="outline-text-4" id="text-29-1-2">
<p>
The study of how a person's intellectual abilities and thought processes change as they grow, notably theorized by developmental psychologists like Jean Piaget.
</p>
</div>
</div>
<div id="outline-container-org93371df" class="outline-4">
<h4 id="org93371df"><span class="section-number-4">29.1.3.</span> Cognitive Function</h4>
<div class="outline-text-4" id="text-29-1-3">
<p>
A term often used in healthcare and neurology to describe an individual's mental capabilities, such as reasoning, focus, and language skills.
</p>
</div>
</div>
</div>
<div id="outline-container-org3fc3535" class="outline-3">
<h3 id="org3fc3535"><span class="section-number-3">29.2.</span> Practical Application</h3>
<div class="outline-text-3" id="text-29-2">
<p>
In practical terms, whenever your brain is working to interpret a sight, learn a new skill, focus on a conversation, or make a choice, it is engaging in a <b>cognitive process</b>.
</p>
</div>
</div>
</div>
<div id="outline-container-org035f1ea" class="outline-2">
<h2 id="org035f1ea"><span class="section-number-2">30.</span> neglect</h2>
<div class="outline-text-2" id="text-30">
<p>
"<b>Neglect</b>" means <b>failing to give enough care, attention, or effort to someone or something, usually due to carelessness or a lapse in responsibility</b>. It can function as both a verb (the action of ignoring or failing to do something) and a noun (the resulting state of being uncared for).
</p>
</div>
<div id="outline-container-org4517bf7" class="outline-3">
<h3 id="org4517bf7"><span class="section-number-3">30.1.</span> Key Usages and Forms</h3>
<div class="outline-text-3" id="text-30-1">
</div>
<div id="outline-container-org1547192" class="outline-4">
<h4 id="org1547192"><span class="section-number-4">30.1.1.</span> Verb (to neglect)</h4>
<div class="outline-text-4" id="text-30-1-1">
<p>
To fail to look after someone or something, or to forget to do a required task.
</p>
<ul class="org-ul">
<li><i>Example:</i> "He <b>neglected</b> his garden, and it became overgrown."</li>
<li><i>Example:</i> "She <b>neglected</b> to lock the front door."</li>
</ul>
</div>
</div>
<div id="outline-container-org981d919" class="outline-4">
<h4 id="org981d919"><span class="section-number-4">30.1.2.</span> Verb (neglect to do)</h4>
<div class="outline-text-4" id="text-30-1-2">
<p>
To fail to do something, often accidentally or due to forgetfulness.
</p>
<ul class="org-ul">
<li><i>Example:</i> "I <b>neglected to</b> inform them of the change in schedule."</li>
</ul>
</div>
</div>
<div id="outline-container-orge1c2749" class="outline-4">
<h4 id="orge1c2749"><span class="section-number-4">30.1.3.</span> Noun (neglect)</h4>
<div class="outline-text-4" id="text-30-1-3">
<p>
The state of being ignored or the act of leaving something in disrepair.
</p>
<ul class="org-ul">
<li><i>Example:</i> "The old building collapsed after years of <b>neglect</b>."</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbe73621" class="outline-3">
<h3 id="orgbe73621"><span class="section-number-3">30.2.</span> Related Contexts</h3>
<div class="outline-text-3" id="text-30-2">
<ul class="org-ul">
<li><b>Legal and Medical:</b> In caregiving and legal contexts, neglect is a severe issue where someone responsible for a dependent fails to provide basic necessities (like food, medical care, or supervision).</li>
<li><b>Common Synonyms:</b> Disregard, ignore, overlook, abandon, or slack on.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdd17909" class="outline-2">
<h2 id="orgdd17909"><span class="section-number-2">31.</span> continent</h2>
<div class="outline-text-2" id="text-31">
<p>
A "<b>continent</b>" is <b>a massive, continuous expanse of land on Earth's surface, generally separated by vast oceans or distinct physical boundaries</b>.
</p>
</div>
<div id="outline-container-org3deb7b6" class="outline-3">
<h3 id="org3deb7b6"><span class="section-number-3">31.1.</span> The Seven Continents</h3>
<div class="outline-text-3" id="text-31-1">
<p>
The Earth is traditionally divided into seven continents, ordered from largest to smallest by land area:
</p>
</div>
<div id="outline-container-org961588b" class="outline-4">
<h4 id="org961588b"><span class="section-number-4">31.1.1.</span> Asia</h4>
<div class="outline-text-4" id="text-31-1-1">
<p>
The largest continent, covering about 30% of the Earth's total land area and home to over half of the world's population.
</p>
</div>
</div>
<div id="outline-container-org05be17d" class="outline-4">
<h4 id="org05be17d"><span class="section-number-4">31.1.2.</span> Africa</h4>
<div class="outline-text-4" id="text-31-1-2">
<p>
The second-largest, known for its incredible geographical and cultural diversity, and home to the world's longest river (the Nile) and the largest hot desert (the Sahara).
</p>
</div>
</div>
