Language learning/learn-english-from-fresh-words.html
<div id="outline-container-orgc17e37c" class="outline-4">
<h4 id="orgc17e37c"><span class="section-number-4">43.1.2.</span> Legal Definition</h4>
<div class="outline-text-4" id="text-43-1-2">
<p>
In the legal context, an "infant" is synonymous with a minor. It refers to anyone who has not yet reached the age of majority (usually 18 years old).
</p>
</div>
</div>
<div id="outline-container-orgfb397cf" class="outline-4">
<h4 id="orgfb397cf"><span class="section-number-4">43.1.3.</span> Early Stages of Development</h4>
<div class="outline-text-4" id="text-43-1-3">
<p>
The word can be used figuratively to describe anything in its earliest stages of existence or development (e.g., an "infant industry").
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8cc961e" class="outline-2">
<h2 id="org8cc961e"><span class="section-number-2">44.</span> estate</h2>
<div class="outline-text-2" id="text-44">
<p>
An "<b>estate</b>" generally refers to <b>the entirety of a person's wealth, including all property, assets, and liabilities</b>. Depending on the context, it can also refer to a large, exclusive plot of land with a substantial residence, or a planned, multi-unit housing or industrial development.
</p>
</div>
<div id="outline-container-org9184e5f" class="outline-3">
<h3 id="org9184e5f"><span class="section-number-3">44.1.</span> Key Definitions by Context</h3>
<div class="outline-text-3" id="text-44-1">
</div>
<div id="outline-container-orgad9b4a8" class="outline-4">
<h4 id="orgad9b4a8"><span class="section-number-4">44.1.1.</span> Law and Inheritance</h4>
<div class="outline-text-4" id="text-44-1-1">
<p>
An estate comprises all the physical and intangible assets a person owns upon their death minus any outstanding debts.
</p>
<ul class="org-ul">
<li>Examples: Real estate, bank accounts, investments, personal items.</li>
<li>Role: An "executor" manages the distribution of this estate.</li>
</ul>
</div>
</div>
<div id="outline-container-org1b976b8" class="outline-4">
<h4 id="org1b976b8"><span class="section-number-4">44.1.2.</span> Property and Real Estate</h4>
<div class="outline-text-4" id="text-44-1-2">
<p>
This describes a large country property featuring a grand house, gardens, and grounds.
</p>
<ul class="org-ul">
<li>Note: The term "real estate" specifically refers to land and the permanent buildings attached to it.</li>
</ul>
</div>
</div>
<div id="outline-container-org3c223ad" class="outline-4">
<h4 id="org3c223ad"><span class="section-number-4">44.1.3.</span> Housing Developments</h4>
<div class="outline-text-4" id="text-44-1-3">
<p>
In British English, an estate often refers to a residential area built with a planned, uniform layout by a single developer.
</p>
<ul class="org-ul">
<li>Synonyms: Housing estate, housing scheme.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8d62231" class="outline-3">
<h3 id="org8d62231"><span class="section-number-3">44.2.</span> Related Legal &amp; Financial Terms</h3>
<div class="outline-text-3" id="text-44-2">
</div>
<div id="outline-container-org60f26c8" class="outline-4">
<h4 id="org60f26c8"><span class="section-number-4">44.2.1.</span> Estate Planning</h4>
<div class="outline-text-4" id="text-44-2-1">
<p>
The process of anticipating and arranging, during a person's life, for the management and disposal of their estate during their life, in the event of incapacity, or upon death.
</p>
</div>
</div>
<div id="outline-container-orgc60f559" class="outline-4">
<h4 id="orgc60f559"><span class="section-number-4">44.2.2.</span> Estate Tax</h4>
<div class="outline-text-4" id="text-44-2-2">
<p>
A tax levied on an heir's inherited portion of an estate, usually triggered only if the estate's total value exceeds a specific government threshold.
</p>
</div>
</div>
<div id="outline-container-orgb085e5c" class="outline-4">
<h4 id="orgb085e5c"><span class="section-number-4">44.2.3.</span> Estate Agent</h4>
<div class="outline-text-4" id="text-44-2-3">
<p>
(UK) A professional who represents buyers and sellers of real property (similar to a <b>real estate agent</b> or <b>realtor</b> in the US).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orge3c1539" class="outline-2">
<h2 id="orge3c1539"><span class="section-number-2">45.</span> initiative</h2>
<div class="outline-text-2" id="text-45">
<p>
An "<b>initiative</b>" refers to <b>the ability to take charge, make decisions, and start new tasks or plans without needing to be told</b>. It also describes a fresh plan, strategy, or opening move designed to solve a problem, seize an advantage, or achieve a goal.
</p>
</div>
<div id="outline-container-org895f0bd" class="outline-3">
<h3 id="org895f0bd"><span class="section-number-3">45.1.</span> Contexts &amp; Definitions</h3>
<div class="outline-text-3" id="text-45-1">
</div>
<div id="outline-container-org64e1fd8" class="outline-4">
<h4 id="org64e1fd8"><span class="section-number-4">45.1.1.</span> Personal Quality (Taking the Initiative)</h4>
<div class="outline-text-4" id="text-45-1-1">
<p>
As a personal trait, having initiative means you are proactive, independent, and willing to take responsibility. 
</p>
<ul class="org-ul">
<li><b>Example:</b> An employee who anticipates a problem and fixes it before their boss assigns the task is showing "initiative".</li>
</ul>
</div>
</div>
<div id="outline-container-org2e16bf3" class="outline-4">
<h4 id="org2e16bf3"><span class="section-number-4">45.1.2.</span> New Plans or Strategies (An Initiative)</h4>
<div class="outline-text-4" id="text-45-1-2">
<p>
In business, government, and daily contexts, an "initiative" is synonymous with a new project or program.
</p>
<ul class="org-ul">
<li><b>Business:</b> A new marketing or cost-cutting initiative.</li>
<li><b>Government:</b> A diplomatic or environmental initiative.</li>
</ul>
</div>
</div>
<div id="outline-container-orgac8c849" class="outline-4">
<h4 id="orgac8c849"><span class="section-number-4">45.1.3.</span> Grabbing or Taking the Advantage</h4>
<div class="outline-text-4" id="text-45-1-3">
<p>
In sports, politics, or negotiations, the phrase <b>"taking the initiative"</b> means to make the first move in order to gain the upper hand or control the direction of the situation.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-07-14 周二 00:00</p>
<p class="author">Author: Buce-Ithon</p>
<p class="date">Created: 2026-07-23 周四 17:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
